app/views/static_pages/home.html.erb

SELECT "items".* FROM "items" ORDER BY "items"."created_at" ASC
---
    <div class="recent-photo">
      <% if !item.item_image.blank? %>