app/views/users/index.html.erb

  <div class="large-4 medium-6 columns center text-center">
  <% if !user.user_image.blank? %>
---
SELECT "users".* FROM "users"