app/views/items/_form.html.erb

  <fieldset>
      <%= collection_check_boxes(:item, :category_ids, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"