app/views/items/index.html.erb

          <%= link_to item do %>
            <% if !item.item_image.blank? %>
---
SELECT "items".* FROM "items"