app/views/items/show.html.erb

<%= link_to @item.user do %>
  <% if !@item.user.user_image.blank? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]