app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.all.sort { |a,b| b.created_at <=> a.created_at }

INSERT INTO "wishlists" ("item_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 6], ["user_id", 2], ["created_at", 2016-08-08 15:03:30 UTC], ["updated_at", 2016-08-08 15:03:30 UTC]]
---
  def add_to_wishlist()
    Wishlist.create(user_id: current_user.id, item_id: @item.id)

INSERT INTO "carts" ("item_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["item_id", 5], ["user_id", 2], ["created_at", 2016-08-08 15:49:25 UTC], ["updated_at", 2016-08-08 15:49:25 UTC]]
---
  def add_to_cart()
    Cart.create(user_id: current_user.id, item_id: @item.id)

INSERT INTO "items" ("name", "description", "armor_photo", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "armor"], ["description", "armor description"], ["armor_photo", "armor img"], ["user_id", 1], ["created_at", 2016-08-05 11:40:02 UTC], ["updated_at", 2016-08-05 11:40:02 UTC]]
---
  def create
    @item = current_user.items.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "updated_at" = $1, "item_image" = $2 WHERE "items"."id" = $3  [["updated_at", 2016-08-08 09:36:20 UTC], ["item_image", "heavy_murmillo_armor.png"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 3]]
---
  def destroy
    @item.destroy

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_item
      @item = Item.find(params[:id])