app/controllers/static_pages_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."created_at" ASC
---
  def home
    @items = Item.all.sort { |a,b| b.created_at <=> a.created_at }